Revit 2026 API
Element.CanHaveTypeAssigned Method
Overload List
Name | Description
CanHaveTypeAssigned() |  Identifies if the element can have a type assigned.
CanHaveTypeAssigned(Document, ICollection<ElementId>)
Top
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace